<html><head><title>&#1053;&#1086;&#1074;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;</title><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">ol{margin:0;padding:0}.c9{color:#333333;font-size:10pt;background-color:#f5f5f5;font-family:"Courier New"}.c0{color:#333333;background-color:#ffffff;font-weight:bold}.c11{max-width:595.6pt;background-color:#ffffff;padding:28.3pt 9.6pt 28.3pt 6.8pt}.c4{widows:2;orphans:2;direction:ltr}.c2{color:#0b0080;background-color:#ffffff}.c7{line-height:1.3636363636363635;padding-bottom:8pt}.c6{color:#333333;background-color:#ffffff}.c12{line-height:1.5;padding-bottom:8pt}.c3{color:inherit;text-decoration:inherit}.c1{color:#252525;background-color:#ffffff}.c5{height:11pt}.c8{font-weight:bold}.c10{vertical-align:super}.title{widows:2;padding-top:0pt;line-height:1.15;orphans:2;text-align:left;color:#000000;font-size:21pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}.subtitle{widows:2;padding-top:0pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-style:italic;font-size:13pt;font-family:"Trebuchet MS";padding-bottom:10pt;page-break-after:avoid}li{color:#000000;font-size:11pt;font-family:"Arial"}p{color:#000000;font-size:11pt;margin:0;font-family:"Arial"}h1{widows:2;padding-top:10pt;line-height:1.15;orphans:2;text-align:left;color:#000000;font-size:16pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}h2{widows:2;padding-top:10pt;line-height:1.15;orphans:2;text-align:left;color:#000000;font-size:13pt;font-family:"Trebuchet MS";font-weight:bold;padding-bottom:0pt;page-break-after:avoid}h3{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-size:12pt;font-family:"Trebuchet MS";font-weight:bold;padding-bottom:0pt;page-break-after:avoid}h4{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-size:11pt;text-decoration:underline;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}h5{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-size:11pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}h6{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-style:italic;font-size:11pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}</style></head><body class="c11"><p class="c4"><span class="c1 c8">&#1040;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089;</span><span class="c1">&nbsp;</span></p><p class="c4"><span class="c1">&#1074; </span><span class="c2"><a class="c3" href="https://www.google.com/url?q=https%3A%2F%2Fru.wikipedia.org%2Fwiki%2F%25D0%259E%25D0%25B1%25D1%258A%25D0%25B5%25D0%25BA%25D1%2582%25D0%25BD%25D0%25BE-%25D0%25BE%25D1%2580%25D0%25B8%25D0%25B5%25D0%25BD%25D1%2582%25D0%25B8%25D1%2580%25D0%25BE%25D0%25B2%25D0%25B0%25D0%25BD%25D0%25BD%25D0%25BE%25D0%25B5_%25D0%25BF%25D1%2580%25D0%25BE%25D0%25B3%25D1%2580%25D0%25B0%25D0%25BC%25D0%25BC%25D0%25B8%25D1%2580%25D0%25BE%25D0%25B2%25D0%25B0%25D0%25BD%25D0%25B8%25D0%25B5&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNES_tVaLGghzVXFXRJk3C_XFHx4cA">&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1086;-&#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080;</a></span><span class="c1">&nbsp;&mdash; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1081; </span><span class="c2"><a class="c3" href="https://www.google.com/url?q=https%3A%2F%2Fru.wikipedia.org%2Fwiki%2F%25D0%259A%25D0%25BB%25D0%25B0%25D1%2581%25D1%2581_(%25D0%25BF%25D1%2580%25D0%25BE%25D0%25B3%25D1%2580%25D0%25B0%25D0%25BC%25D0%25BC%25D0%25B8%25D1%2580%25D0%25BE%25D0%25B2%25D0%25B0%25D0%25BD%25D0%25B8%25D0%25B5)&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNH3OdNwPAfU0FTr-BVj014bVj4pCQ">&#1082;&#1083;&#1072;&#1089;&#1089;</a></span><span class="c1">, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1077; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1074;. &#1040;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1102;&#1090; &#1085;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1086;&#1074; &#1054;&#1054;&#1055; &mdash; </span><span class="c2"><a class="c3" href="https://www.google.com/url?q=https%3A%2F%2Fru.wikipedia.org%2Fwiki%2F%25D0%259F%25D0%25BE%25D0%25BB%25D0%25B8%25D0%25BC%25D0%25BE%25D1%2580%25D1%2584%25D0%25B8%25D0%25B7%25D0%25BC_(%25D0%25BF%25D1%2580%25D0%25BE%25D0%25B3%25D1%2580%25D0%25B0%25D0%25BC%25D0%25BC%25D0%25B8%25D1%2580%25D0%25BE%25D0%25B2%25D0%25B0%25D0%25BD%25D0%25B8%25D0%25B5)&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNFWtpEFD3unMhkDFUXMNwaZWls-pg">&#1087;&#1086;&#1083;&#1080;&#1084;&#1086;&#1088;&#1092;&#1080;&#1079;&#1084;</a></span><span class="c1">. &#1040;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; (&#1080; &#1085;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100;</span><span class="c2 c10"><a class="c3" href="https://www.google.com/url?q=https%3A%2F%2Fru.wikipedia.org%2Fwiki%2F%25D0%2590%25D0%25B1%25D1%2581%25D1%2582%25D1%2580%25D0%25B0%25D0%25BA%25D1%2582%25D0%25BD%25D1%258B%25D0%25B9_%25D0%25BA%25D0%25BB%25D0%25B0%25D1%2581%25D1%2581%23cite_note-1&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNFfdeOeSVHeXf6FfV8_kWRplc5FSg">[1]</a></span><span class="c1">) </span><span class="c2"><a class="c3" href="https://www.google.com/url?q=https%3A%2F%2Fru.wikipedia.org%2Fwiki%2F%25D0%2590%25D0%25B1%25D1%2581%25D1%2582%25D1%2580%25D0%25B0%25D0%25BA%25D1%2582%25D0%25BD%25D1%258B%25D0%25B9_%25D0%25BC%25D0%25B5%25D1%2582%25D0%25BE%25D0%25B4&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNHdV-IhhFvx9vMpk96baoNtrjujjA">&#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;</a></span><span class="c1">&nbsp;&#1080; </span><span class="c2"><a class="c3" href="https://www.google.com/url?q=https%3A%2F%2Fru.wikipedia.org%2Fwiki%2F%25D0%25A1%25D0%25B2%25D0%25BE%25D0%25B9%25D1%2581%25D1%2582%25D0%25B2%25D0%25BE_(%25D0%25BF%25D1%2580%25D0%25BE%25D0%25B3%25D1%2580%25D0%25B0%25D0%25BC%25D0%25BC%25D0%25B8%25D1%2580%25D0%25BE%25D0%25B2%25D0%25B0%25D0%25BD%25D0%25B8%25D0%25B5)&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNGoAb_z9dSbNt0izeS2wrH1YSAUQg">&#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</a></span><span class="c1">. &#1040;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1099;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; &#1085;&#1077; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085; &#1076;&#1083;&#1103; &#1077;&#1075;&#1086; &#1085;&#1077;&#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1099;&#1093; &#1087;&#1086;&#1090;&#1086;&#1084;&#1082;&#1086;&#1074;. &#1040;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077;</span><span class="c2"><a class="c3" href="https://www.google.com/url?q=https%3A%2F%2Fru.wikipedia.org%2Fwiki%2F%25D0%259E%25D0%25B1%25D0%25BE%25D0%25B1%25D1%2589%25D0%25B5%25D0%25BD%25D0%25B8%25D0%25B5_%25D0%25BF%25D0%25BE%25D0%25BD%25D1%258F%25D1%2582%25D0%25B8%25D0%25B9&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNGDzmfXJFEZ8dQ4b8sQ7lOQoWkEMQ">&#1086;&#1073;&#1097;&#1080;&#1077;</a></span><span class="c1">&nbsp;&#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1094;&#1080;&#1080;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1077; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1081; </span><span class="c2"><a class="c3" href="https://www.google.com/url?q=https%3A%2F%2Fru.wikipedia.org%2Fwiki%2F%25D0%259E%25D0%25B1%25D1%258A%25D1%2591%25D0%25BC_%25D0%25BF%25D0%25BE%25D0%25BD%25D1%258F%25D1%2582%25D0%25B8%25D1%258F&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNEOTip-Tn_7l3ZHFJzmljmXWULSLg">&#1086;&#1073;&#1098;&#1105;&#1084;</a></span><span class="c1">&nbsp;&#1080; &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1100;&#1096;&#1077;&#1077; </span><span class="c2"><a class="c3" href="https://www.google.com/url?q=https%3A%2F%2Fru.wikipedia.org%2Fwiki%2F%25D0%25A1%25D0%25BE%25D0%25B4%25D0%25B5%25D1%2580%25D0%25B6%25D0%25B0%25D0%25BD%25D0%25B8%25D0%25B5_%25D0%25BF%25D0%25BE%25D0%25BD%25D1%258F%25D1%2582%25D0%25B8%25D1%258F&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNHPb9inZ_4Om9jeRPDoKk8BNbIe4A">&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a></span><span class="c1">.</span></p><p class="c4 c5"><span class="c1"></span></p><p class="c4 c7"><span class="c6">&#1050;&#1083;&#1072;&#1089;&#1089;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1081; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;, &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1099;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1084;. &#1058;&#1072;&#1082;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1087;&#1086;&#1084;&#1077;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1084; &#1089;&#1083;&#1086;&#1074;&#1086;&#1084; </span><span class="c0">abstract</span><span class="c6">.</span></p><p class="c4 c7"><span class="c6">&#1040;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1099;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; &#1085;&#1077; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1105;&#1085;. &#1054;&#1085; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1079; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080; &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1090;&#1077;&#1083;&#1072;:</span></p><p class="c4 c12"><span class="c9">abstract void yourMethod();<br></span><span class="c6">&#1055;&#1086; &#1089;&#1091;&#1090;&#1080;, &#1084;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1084; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1099;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; &#1076;&#1083;&#1103; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1083;&#1086;&#1097;&#1072;&#1076;&#1080; &#1092;&#1080;&#1075;&#1091;&#1088;&#1099; &#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1077; &#1060;&#1080;&#1075;&#1091;&#1088;&#1072;. &#1040; &#1074;&#1089;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1086;&#1090; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1084;&#1086;&#1075;&#1091;&#1090; &#1091;&#1078;&#1077; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081; &#1082;&#1086;&#1076; &#1076;&#1083;&#1103; &#1075;&#1086;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;. &#1042;&#1077;&#1076;&#1100; &#1087;&#1083;&#1086;&#1097;&#1072;&#1076;&#1100; &#1091; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1072; &#1080; &#1090;&#1088;&#1077;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1072; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1088;&#1072;&#1079;&#1085;&#1099;&#1084; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;&#1084; &#1080; &#1091;&#1085;&#1080;&#1074;&#1077;&#1088;&#1089;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1085;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;.</span></p><p class="c4 c7"><span class="c6">&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;, &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1085;&#1099;&#1081; &#1086;&#1090; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1085;&#1086; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1080;&#1084;&#1077;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072;, &#1074;&#1072;&#1084; &#1087;&#1088;&#1080;&#1076;&#1105;&#1090;&#1089;&#1103; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1099;&#1093; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; &#1090;&#1086;&#1078;&#1077; &#1086;&#1089;&#1090;&#1072;&#1085;&#1077;&#1090;&#1089;&#1103; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1099;&#1084;, &#1080; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1090;&#1086;&#1088; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090; &#1087;&#1086;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1084; &#1089;&#1083;&#1086;&#1074;&#1086;&#1084;</span><span class="c0">abstract</span><span class="c6">.</span></p><p class="c4 c7"><span class="c6">&#1052;&#1086;&#1078;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1082;&#1083;&#1072;&#1089;&#1089; &#1089; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1084; &#1089;&#1083;&#1086;&#1074;&#1086;&#1084; </span><span class="c0">abstract</span><span class="c6">&nbsp;&#1076;&#1072;&#1078;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1074; &#1085;&#1077;&#1084; &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1085;&#1080; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;. &#1069;&#1090;&#1086; &#1073;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1084; &#1074; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;&#1093;, &#1075;&#1076;&#1077; &#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1077; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1099;, &#1085;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1079;&#1072;&#1087;&#1088;&#1077;&#1090;&#1080;&#1090;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1074; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;.</span></p><p class="c4 c7"><span class="c6">&#1042; &#1090;&#1086;&#1078;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1080;&#1084;&#1077;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;. &#1053;&#1072;&#1087;&#1086;&#1084;&#1085;&#1102; &#1077;&#1097;&#1105; &#1088;&#1072;&#1079;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1083;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1093;&#1086;&#1090;&#1103; &#1073;&#1099; &#1086;&#1076;&#1080;&#1085; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1099;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076;, &#1090;&#1086; &#1086;&#1085; &#1086;&#1073;&#1103;&#1079;&#1072;&#1085; &#1073;&#1099;&#1090;&#1100; &#1089;&#1072;&#1084; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1099;&#1084;.</span></p><p class="c4 c5"><span class="c1"></span></p></body></html>