<html><head><title>&#1053;&#1086;&#1074;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;</title><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">ol{margin:0;padding:0}.c6{line-height:1.2409091429276933;widows:2;orphans:2;text-align:justify;direction:ltr}.c7{color:#7d181e;font-size:17pt;background-color:#fefdfa;font-family:"Georgia";font-weight:normal}.c0{color:#333333;font-size:10pt;background-color:#fefdfa;font-family:"Georgia"}.c8{widows:2;orphans:2;direction:ltr;page-break-after:avoid}.c1{color:#7d181e;font-size:10pt;background-color:#fefdfa;font-family:"Georgia"}.c2{font-size:10pt;background-color:#ffffff;font-family:"Georgia"}.c15{font-size:9pt;background-color:#fefdfa;font-family:"Georgia"}.c10{max-width:468pt;background-color:#ffffff;padding:72pt 72pt 72pt 72pt}.c18{padding-top:11pt;padding-bottom:2pt;page-break-after:avoid}.c9{widows:2;orphans:2;direction:ltr}.c14{line-height:1.2409091429276933;text-align:center}.c17{color:inherit;text-decoration:inherit}.c11{font-weight:bold}.c12{color:#008000}.c3{color:#333333}.c5{color:#0000ff}.c16{font-style:italic}.c13{height:11pt}.c4{color:#2b91af}.title{widows:2;padding-top:0pt;line-height:1.15;orphans:2;text-align:left;color:#000000;font-size:21pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}.subtitle{widows:2;padding-top:0pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-style:italic;font-size:13pt;font-family:"Trebuchet MS";padding-bottom:10pt;page-break-after:avoid}li{color:#000000;font-size:11pt;font-family:"Arial"}p{color:#000000;font-size:11pt;margin:0;font-family:"Arial"}h1{widows:2;padding-top:10pt;line-height:1.15;orphans:2;text-align:left;color:#000000;font-size:16pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}h2{widows:2;padding-top:10pt;line-height:1.15;orphans:2;text-align:left;color:#000000;font-size:13pt;font-family:"Trebuchet MS";font-weight:bold;padding-bottom:0pt;page-break-after:avoid}h3{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-size:12pt;font-family:"Trebuchet MS";font-weight:bold;padding-bottom:0pt;page-break-after:avoid}h4{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-size:11pt;text-decoration:underline;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}h5{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-size:11pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}h6{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-style:italic;font-size:11pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}</style></head><body class="c10"><h3 class="c8"><a name="h.6ryue2b6k8ai"></a><span class="c7">&#1053;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; vs &#1050;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103; vs &#1040;&#1075;&#1088;&#1077;&#1075;&#1072;&#1094;&#1080;&#1103;</span></h3><p class="c6"><span class="c0">&#1052;&#1077;&#1078;&#1076;&#1091; &#1076;&#1074;&#1091;&#1084;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084;&#1080;/&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1090;&#1080;&#1087;&#1099; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1081;. &#1057;&#1072;&#1084;&#1099;&#1084; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1084; &#1090;&#1080;&#1087;&#1086;&#1084; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1081; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; </span><span class="c0 c16">&#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1103; </span><span class="c0">(association), &#1101;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1076;&#1074;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1082;&#1072;&#1082;-&#1090;&#1086; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1099; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1086;&#1073;&#1086;&#1081;, &#1080; &#1084;&#1099; &#1087;&#1086;&#1082;&#1072; &#1085;&#1077; &#1079;&#1085;&#1072;&#1077;&#1084; &#1090;&#1086;&#1095;&#1085;&#1086;, &#1074; &#1095;&#1077;&#1084; &#1101;&#1090;&#1072; &#1089;&#1074;&#1103;&#1079;&#1100; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1072; &#1080; &#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1077;&#1084;&#1089;&#1103; &#1091;&#1090;&#1086;&#1095;&#1085;&#1080;&#1090;&#1100; &#1077;&#1077; &#1074; &#1073;&#1091;&#1076;&#1091;&#1097;&#1077;&#1084;. &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1101;&#1090;&#1086; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1088;&#1072;&#1085;&#1085;&#1080;&#1093; &#1101;&#1090;&#1072;&#1087;&#1072;&#1093; &#1076;&#1080;&#1079;&#1072;&#1081;&#1085;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1084;&#1077;&#1078;&#1076;&#1091; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084;&#1080; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;, &#1080; &#1076;&#1074;&#1080;&#1075;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1072;&#1083;&#1100;&#1096;&#1077;.</span></p><p class="c9 c14"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 613.33px; height: 285.33px;"><img alt="image" src="images/image03.png" style="width: 613.33px; height: 285.33px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title="image"></span></p><p class="c9 c14"><span class="c0">&#1056;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 1. &#1054;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1080;</span></p><p class="c6"><span class="c0">&#1041;&#1086;&#1083;&#1077;&#1077; &#1090;&#1086;&#1095;&#1085;&#1099;&#1084; &#1090;&#1080;&#1087;&#1086;&#1084; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1081; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; (&#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &laquo;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;&raquo;, IS A Relationship), &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1077;, &#1095;&#1090;&#1086; &#1089;&#1087;&#1088;&#1072;&#1074;&#1077;&#1076;&#1083;&#1080;&#1074;&#1086; &#1076;&#1083;&#1103; &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1089;&#1087;&#1088;&#1072;&#1074;&#1077;&#1076;&#1083;&#1080;&#1074;&#1086; &#1080; &#1076;&#1083;&#1103; &#1077;&#1075;&#1086; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1082;&#1072;. &#1048;&#1084;&#1077;&#1085;&#1085;&#1086; &#1089; &#1077;&#1075;&#1086; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084; &#1087;&#1086;&#1083;&#1080;&#1084;&#1086;&#1088;&#1092;&#1085;&#1086;&#1077; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;, &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1075;&#1080;&#1088;&#1091;&#1077;&#1084;&#1089;&#1103; &#1086;&#1090; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1081; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;, &#1080;&#1084;&#1077;&#1103; &#1076;&#1077;&#1083;&#1086; &#1083;&#1080;&#1096;&#1100; &#1089; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080; (&#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;&#1084;&#1080; &#1080;&#1083;&#1080; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1084;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084;&#1080;) &#1080; &#1085;&#1077; &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;.</span></p><p class="c9 c14"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 232.00px; height: 314.67px;"><img alt="image" src="images/image02.png" style="width: 232.00px; height: 314.67px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title="image"></span></p><p class="c9 c14"><span class="c0">&#1056;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 2. &#1054;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</span></p><p class="c6"><span class="c0">&#1048; &#1093;&#1086;&#1090;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1099;&#1084; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; &#1074; &#1088;&#1091;&#1082;&#1072;&#1093; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1054;&#1054;-&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1072;, &#1077;&#1075;&#1086; &#1103;&#1074;&#1085;&#1086; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1076;&#1083;&#1103; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074; &#1079;&#1072;&#1076;&#1072;&#1095;. &#1042;&#1086;-&#1087;&#1077;&#1088;&#1074;&#1099;&#1093;, &#1076;&#1072;&#1083;&#1077;&#1082;&#1086; &#1085;&#1077; &#1074;&#1089;&#1077; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084;&#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077;&#1084; &laquo;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;&raquo;, &#1072; &#1074;&#1086;-&#1074;&#1090;&#1086;&#1088;&#1099;&#1093;, &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1072;&#1084;&#1086;&#1081; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1074;&#1103;&#1079;&#1100;&#1102; &#1084;&#1077;&#1078;&#1076;&#1091; &#1076;&#1074;&#1091;&#1084;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1079;&#1086;&#1088;&#1074;&#1072;&#1090;&#1100; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; (&#1101;&#1090;&#1086; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1080;, &#1074; &#1089;&#1090;&#1088;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1103;&#1079;&#1099;&#1082;&#1072;&#1093; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1080;).</span></p><p class="c6"><span class="c0">&#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1085;&#1072;&#1084; &#1085;&#1072; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1090; &#1076;&#1088;&#1091;&#1075;&#1072;&#1103; &#1087;&#1072;&#1088;&#1072; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1081;: </span><span class="c0 c11">&#1082;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103;</span><span class="c0">&nbsp;(composition) &#1080; </span><span class="c0 c11">&#1072;&#1075;&#1088;&#1077;&#1075;&#1072;&#1094;&#1080;&#1103;</span><span class="c0">(aggregation). &#1054;&#1073;&#1072; &#1086;&#1085;&#1080; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1091;&#1102;&#1090; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &laquo;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100;&#1102;&raquo; (HAS-A Relationship) &#1080; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1074;&#1099;&#1088;&#1072;&#1078;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089; &#1094;&#1077;&#1083;&#1086;&#1075;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1087;&#1086;&#1083;&#1103; (&#1080;&#1083;&#1080; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;) &#1089;&#1074;&#1086;&#1080;&#1093; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1099;&#1093; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081;. &#1043;&#1088;&#1072;&#1085;&#1100; &#1084;&#1077;&#1078;&#1076;&#1091; &#1085;&#1080;&#1084;&#1080; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1090;&#1086;&#1085;&#1082;&#1072;&#1103;, &#1085;&#1086; &#1074;&#1072;&#1078;&#1085;&#1072;&#1103;, &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1103;&#1084;&#1080;.</span></p><p class="c9 c14"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 613.33px; height: 425.33px;"><img alt="image" src="images/image00.png" style="width: 613.33px; height: 425.33px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title="image"></span></p><p class="c9 c14"><span class="c0">&#1056;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 3. &#1054;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080; &#1080; &#1072;&#1075;&#1088;&#1077;&#1075;&#1072;&#1094;&#1080;&#1080;</span></p><p class="c6"><span class="c0 c11">HINT</span></p><p class="c6"><span class="c0">&#1055;&#1072;&#1088;&#1072; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1083;&#1077;&#1075;&#1095;&#1077; &#1079;&#1072;&#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1100; &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1085;&#1086;&#1090;&#1072;&#1094;&#1080;&#1102;: (1) </span><span class="c0 c16">&#1088;&#1086;&#1084;&#1073;&#1080;&#1082; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089;&#1086; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1094;&#1077;&#1083;&#1086;&#1075;&#1086;, &#1072; &#1087;&#1088;&#1086;&#1089;&#1090;&#1072;&#1103; &#1083;&#1080;&#1085;&#1080;&#1103; &#1089;&#1086; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;</span><span class="c0">; (2) </span><span class="c0 c16">&#1079;&#1072;&#1082;&#1088;&#1072;&#1096;&#1077;&#1085;&#1085;&#1099;&#1081; &#1088;&#1086;&#1084;&#1073; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1080;&#1083;&#1100;&#1085;&#1091;&#1102; &#1089;&#1074;&#1103;&#1079;&#1100; &ndash; &#1082;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102;, &#1085;&#1077;&#1079;&#1072;&#1082;&#1088;&#1072;&#1096;&#1077;&#1085;&#1085;&#1099;&#1081; &#1088;&#1086;&#1084;&#1073; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1083;&#1072;&#1073;&#1091;&#1102; &#1089;&#1074;&#1103;&#1079;&#1100; &ndash; &#1072;&#1075;&#1088;&#1077;&#1075;&#1072;&#1094;&#1080;&#1102;.</span></p><p class="c6"><span class="c0">&#1056;&#1072;&#1079;&#1085;&#1080;&#1094;&#1072; &#1084;&#1077;&#1078;&#1076;&#1091; &#1082;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1077;&#1081; &#1080; &#1072;&#1075;&#1088;&#1077;&#1075;&#1072;&#1094;&#1080;&#1077;&#1081; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; </span><span class="c0 c11">&#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080;</span><span class="c0">&nbsp;</span><span class="c0 c11">&#1094;&#1077;&#1083;&#1086;&#1077; &#1103;&#1074;&#1085;&#1086; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1080;&#1088;&#1091;&#1077;&#1090; &#1074;&#1088;&#1077;&#1084;&#1103; &#1078;&#1080;&#1079;&#1085;&#1080; &#1089;&#1074;&#1086;&#1077;&#1081; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;</span><span class="c0">&nbsp;(&#1095;&#1072;&#1089;&#1090;&#1100; &#1085;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1073;&#1077;&#1079; &#1094;&#1077;&#1083;&#1086;&#1075;&#1086;), &#1072; </span><span class="c0 c11">&#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1072;&#1075;&#1088;&#1077;&#1075;&#1072;&#1094;&#1080;&#1080; &#1094;&#1077;&#1083;&#1086;&#1077; &#1093;&#1086;&#1090;&#1100; &#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1089;&#1074;&#1086;&#1102; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1091;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100;, &#1074;&#1088;&#1077;&#1084;&#1103; &#1080;&#1093; &#1078;&#1080;&#1079;&#1085;&#1080; &#1085;&#1077; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1086;</span><span class="c0">&nbsp;(&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072;).</span></p><p class="c9"><span class="c2 c5">class</span><span class="c2">&nbsp;</span><span class="c2 c4">CompositeCustomService</span><span class="c2 c3"><br></span><span class="c2">{</span></p><p class="c9"><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c2 c12">// &#1050;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103;</span><span class="c2 c3"><br></span><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c2 c5">private</span><span class="c2">&nbsp;</span><span class="c2 c5">readonly</span><span class="c2">&nbsp;</span><span class="c2 c4">CustomRepository</span><span class="c2">&nbsp;_repository</span></p><p class="c9"><span class="c2">&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;= </span><span class="c2 c5">new</span><span class="c2">&nbsp;</span><span class="c2 c4">CustomRepository</span><span class="c2">();</span></p><p class="c9"><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c2 c5">public</span><span class="c2">&nbsp;</span><span class="c2 c5">void</span><span class="c2">&nbsp;DoSomething()</span></p><p class="c9"><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;{</span></p><p class="c9"><span class="c2">&nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c2 c12">// &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084; _repository</span><span class="c2 c3"><br></span><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;}<br>}</span></p><p class="c9"><span class="c2 c5">class</span><span class="c2">&nbsp;</span><span class="c2 c4">AggregatedCustomService</span><span class="c2 c3"><br></span><span class="c2">{</span></p><p class="c9"><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c2 c12">// &#1040;&#1075;&#1088;&#1077;&#1075;&#1072;&#1094;&#1080;&#1103;</span><span class="c2 c3"><br></span><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c2 c5">private</span><span class="c2">&nbsp;</span><span class="c2 c5">readonly</span><span class="c2">&nbsp;</span><span class="c2 c4">AbstractRepository</span><span class="c2">&nbsp;_repository;</span></p><p class="c9"><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c2 c5">public</span><span class="c2">&nbsp;AggregatedCustomService(</span><span class="c2 c4">AbstractRepository</span><span class="c2">&nbsp;repository)</span></p><p class="c9"><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;{</span></p><p class="c9"><span class="c2">&nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;_repository = repository;</span></p><p class="c9"><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;}</span></p><p class="c9"><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c2 c5">public</span><span class="c2">&nbsp;</span><span class="c2 c5">void</span><span class="c2">&nbsp;DoSomething()</span></p><p class="c9"><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;{</span></p><p class="c9"><span class="c2">&nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c2 c12">// &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084; _repository</span><span class="c2 c3"><br></span><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;}<br>}</span></p><p class="c6"><span class="c0 c11">CompositeCustomService</span><span class="c0">&nbsp;&#1076;&#1083;&#1103; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1074;&#1086;&#1080;&#1084;&#1080; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1099;&#1084;&#1080; &#1095;&#1072;&#1089;&#1090;&#1103;&#1084;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1082;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102;, &#1072;</span><span class="c0 c11">AggregatedCustomService</span><span class="c0">&nbsp;&ndash; &#1072;&#1075;&#1088;&#1077;&#1075;&#1072;&#1094;&#1080;&#1102;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1103;&#1074;&#1085;&#1099;&#1081; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1078;&#1080;&#1079;&#1085;&#1080; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090; &#1082; &#1073;&#1086;&#1083;&#1077;&#1077; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1081; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1094;&#1077;&#1083;&#1099;&#1084; &#1080; &#1095;&#1072;&#1089;&#1090;&#1100;&#1102;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1081; &#1090;&#1080;&#1087;, &#1090;&#1077;&#1089;&#1085;&#1086; &#1089;&#1074;&#1103;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1091;&#1095;&#1072;&#1089;&#1090;&#1085;&#1080;&#1082;&#1086;&#1074; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1086;&#1073;&#1086;&#1081;.</span></p><p class="c6"><span class="c0">&#1057; &#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;, &#1090;&#1072;&#1082;&#1072;&#1103; &#1078;&#1077;&#1089;&#1090;&#1082;&#1072;&#1103; &#1089;&#1074;&#1103;&#1079;&#1100; &#1084;&#1086;&#1078;&#1077;&#1090; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1095;&#1077;&#1084;-&#1090;&#1086; &#1087;&#1083;&#1086;&#1093;&#1080;&#1084;, &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1082;&#1086;&#1075;&#1076;&#1072; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1100;&#1085;&#1086;&#1081; (&#1089;&#1084;. &#1088;&#1072;&#1079;&#1076;&#1077;&#1083; </span><span class="c1"><a class="c17" href="http://www.google.com/url?q=http%3A%2F%2Fsergeyteplyakov.blogspot.com%2F2012%2F11%2Fblog-post.html&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNE29gGKBLexMtRfOTPvD-sLAUTE8w">&laquo;&#1057;&#1090;&#1072;&#1073;&#1080;&#1083;&#1100;&#1085;&#1099;&#1077; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1095;&#1080;&#1074;&#1099;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;&raquo;</a></span><span class="c0">&nbsp;&#1074; &#1087;&#1088;&#1086;&#1096;&#1083;&#1086;&#1081; &#1079;&#1072;&#1084;&#1077;&#1090;&#1082;&#1077;). &#1057; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1080; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1088;&#1077;&#1084;&#1103; &#1078;&#1080;&#1079;&#1085;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1085;&#1077; &#1079;&#1072;&#1074;&#1103;&#1079;&#1099;&#1074;&#1072;&#1103;&#1089;&#1100; &#1085;&#1072; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1077; &#1090;&#1080;&#1087;&#1099;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1086;&#1081; &#1092;&#1072;&#1073;&#1088;&#1080;&#1082;&#1080;:</span></p><p class="c9"><span class="c2 c5">internal</span><span class="c2">&nbsp;</span><span class="c2 c5">interface</span><span class="c2">&nbsp;</span><span class="c2 c4">IRepositoryFactory</span><span class="c2 c3"><br></span><span class="c2">{</span></p><p class="c9"><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c2 c4">AbstractRepository</span><span class="c2">&nbsp;Create();<br>}<br> <br></span><span class="c2 c5">class</span><span class="c2">&nbsp;</span><span class="c2 c4">CustomService</span><span class="c2 c3"><br></span><span class="c2">{</span></p><p class="c9"><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c2 c12">// &#1050;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103;</span><span class="c2 c3"><br></span><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c2 c5">private</span><span class="c2">&nbsp;</span><span class="c2 c5">readonly</span><span class="c2">&nbsp;</span><span class="c2 c4">IRepositoryFactory</span><span class="c2">&nbsp;_repositoryFactory;</span></p><p class="c9"><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c2 c5">public</span><span class="c2">&nbsp;CustomService(</span><span class="c2 c4">IRepositoryFactory</span><span class="c2">&nbsp;repositoryFactory)</span></p><p class="c9"><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;{</span></p><p class="c9"><span class="c2">&nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;_repositoryFactory = repositoryFactory;</span></p><p class="c9"><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;}</span></p><p class="c9"><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c2 c5">public</span><span class="c2">&nbsp;</span><span class="c2 c5">void</span><span class="c2">&nbsp;DoSomething()</span></p><p class="c9"><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;{</span></p><p class="c9"><span class="c2">&nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c2 c5">var</span><span class="c2">&nbsp;repository = _repositoryFactory.Create();</span></p><p class="c9"><span class="c2">&nbsp; &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</span><span class="c2 c12">// &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; AbstractRepository</span><span class="c2 c3"><br></span><span class="c2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;}<br>}</span></p><p class="c6"><span class="c0">&#1042; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1084;&#1099; &#1085;&#1077; &#1080;&#1079;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1089;&#1103; &#1086;&#1090; &#1082;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080; (</span><span class="c0 c11">CustomService</span><span class="c0">&nbsp;&#1074;&#1089;&#1077; &#1077;&#1097;&#1077; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1080;&#1088;&#1091;&#1077;&#1090; &#1074;&#1088;&#1077;&#1084;&#1103; &#1078;&#1080;&#1079;&#1085;&#1080;</span><span class="c0 c11">AbstractRepository</span><span class="c0">), &#1085;&#1086; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1101;&#1090;&#1086; &#1085;&#1077; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102;, &#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1094;&#1080;&#1080; &ndash; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1086;&#1081; &#1092;&#1072;&#1073;&#1088;&#1080;&#1082;&#1080;. &#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1090;&#1072;&#1082;&#1086;&#1081; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1091;&#1076;&#1074;&#1086;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1085;&#1072;&#1096;&#1080;&#1093; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081;, &#1090;&#1086; &#1077;&#1075;&#1086; &#1089;&#1090;&#1086;&#1080;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1103;&#1074;&#1085;&#1099;&#1081; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1078;&#1080;&#1079;&#1085;&#1080; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1084; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077;&#1084;.</span></p><p class="c6"><span class="c0">&#1048;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1086;&#1081; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1081; &#1084;&#1077;&#1078;&#1076;&#1091; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084;&#1080; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1093; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1074;&#1080;&#1089;&#1077;&#1090;&#1100; &#1086;&#1090; &#1090;&#1086;&#1095;&#1082;&#1080; &#1079;&#1088;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1097;&#1080;&#1082;&#1072;, &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1089; &#1082;&#1072;&#1082;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1086;&#1085; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090; &#1085;&#1072; &#1079;&#1072;&#1076;&#1072;&#1095;&#1091; &#1080; &#1082;&#1072;&#1082;&#1080;&#1077; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1099; &#1086;&#1085; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1077;&#1073;&#1077; &#1087;&#1088;&#1080; &#1077;&#1077; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1077;. &#1048;&#1084;&#1077;&#1085;&#1085;&#1086; &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1086;&#1076;&#1085;&#1091; &#1080; &#1090;&#1091; &#1078;&#1077; &#1079;&#1072;&#1076;&#1072;&#1095;&#1091; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1076;&#1077;&#1089;&#1103;&#1090;&#1082;&#1086;&#1084; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1074;, &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1074; &#1086;&#1076;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1084;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1084; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1076;&#1080;&#1079;&#1072;&#1081;&#1085; &#1089; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1084; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080;, &#1072; &#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &ndash; &#1101;&#1090;&#1072; &#1078;&#1077; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1072;&#1079;&#1073;&#1080;&#1090;&#1072; &#1085;&#1072; &#1073;&#1086;&#1083;&#1077;&#1077; &#1072;&#1074;&#1090;&#1086;&#1085;&#1086;&#1084;&#1085;&#1099;&#1077; &#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1073;&#1083;&#1086;&#1082;&#1080;, &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1103;&#1077;&#1084;&#1099;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1086;&#1073;&#1086;&#1081; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1072;&#1075;&#1088;&#1077;&#1075;&#1072;&#1094;&#1080;&#1080;.</span></p><p class="c6"><span class="c0">&#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1072;&#1096;&#1091; &#1079;&#1072;&#1076;&#1072;&#1095;&#1091; &#1089; &#1089;&#1077;&#1088;&#1074;&#1080;&#1089;&#1072;&#1084;&#1080; &#1080; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1072;&#1088;&#1080;&#1103;&#1084;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1074;. &#1050;&#1090;&#1086;-&#1090;&#1086; &#1089;&#1082;&#1072;&#1078;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1086;&#1076;&#1086;&#1081;&#1076;&#1077;&#1090; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080; &#1089;&#1076;&#1077;&#1083;&#1072;&#1077;&#1090; </span><span class="c0 c11">SqlCustomService</span><span class="c0">&nbsp;&#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1082;&#1086;&#1084; &#1086;&#1090;</span><span class="c0 c11">AbstractCustomService</span><span class="c0">; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1082;&#1072;&#1078;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086;&#1090; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076; &#1085;&#1077;&#1074;&#1077;&#1088;&#1077;&#1085;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; </span><span class="c0 c11">CustomService</span><span class="c0">&nbsp;&#1091; &#1085;&#1072;&#1089; &#1086;&#1076;&#1080;&#1085;, &#1072; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1091; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1072;&#1088;&#1080;&#1077;&#1074;.</span></p><p class="c9 c14"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 624.00px; height: 278.67px;"><img alt="image" src="images/image01.png" style="width: 624.00px; height: 278.67px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title="image"></span></p><p class="c9 c14"><span class="c0">&#1056;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 4. &#1053;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; vs &#1040;&#1075;&#1088;&#1077;&#1075;&#1072;&#1094;&#1080;&#1103;</span></p><p class="c6"><span class="c0">&#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090; &#1082; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1080; &#1090;&#1086;&#1084;&#1091; &#1078;&#1077; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1084;&#1091; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1091;, &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090; &#1086;&#1095;&#1077;&#1085;&#1100; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1081; (&#1087;&#1088;&#1080; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080;) &#1082; &#1086;&#1095;&#1077;&#1085;&#1100; &#1089;&#1083;&#1072;&#1073;&#1086;&#1081; (&#1087;&#1088;&#1080; &#1072;&#1075;&#1088;&#1077;&#1075;&#1072;&#1094;&#1080;&#1080;).</span></p><h5 class="c6 c18"><a name="h.b0miku7x6cwc"></a><span class="c11 c3 c15">&#1047;&#1072;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;</span></h5><p class="c6"><span class="c0">&#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1082;&#1088;&#1080;&#1090;&#1077;&#1088;&#1080;&#1077;&#1074; &#1076;&#1083;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1074;&#1103;&#1079;&#1085;&#1086;&#1089;&#1090;&#1080; &#1076;&#1080;&#1079;&#1072;&#1081;&#1085;&#1072; &#1087;&#1086; &#1076;&#1080;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;: &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1077; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1080; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; (&#1075;&#1083;&#1091;&#1073;&#1086;&#1082;&#1080;&#1077; &#1080;&#1083;&#1080; &#1096;&#1080;&#1088;&#1086;&#1082;&#1080;&#1077; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1080;), &#1080; &#1087;&#1086;&#1074;&#1089;&#1077;&#1084;&#1077;&#1089;&#1090;&#1085;&#1086;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080;, &#1072; &#1085;&#1077; &#1072;&#1075;&#1088;&#1077;&#1075;&#1072;&#1094;&#1080;&#1080; &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090; &#1086; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1086;&#1084; &#1076;&#1080;&#1079;&#1072;&#1081;&#1085;&#1077;.</span></p><p class="c6"><span class="c0">&#1041;&#1086;&#1083;&#1100;&#1096;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1097;&#1080;&#1082;&#1080; &#1079;&#1072;&#1073;&#1099;&#1083;&#1080; &#1086; &#1089;&#1090;&#1072;&#1088;&#1086;&#1084; &#1076;&#1086;&#1073;&#1088;&#1086;&#1084; &#1089;&#1086;&#1074;&#1077;&#1090;&#1077; &#1041;&#1072;&#1085;&#1076;&#1099; &#1063;&#1077;&#1090;&#1099;&#1088;&#1077;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1082; &#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; </span><span class="c0 c11">&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1077;&#1089;&#1090;&#1100; &#1072;&#1075;&#1088;&#1077;&#1075;&#1072;&#1094;&#1080;&#1102; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102;, </span><span class="c0">&#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1087;&#1077;&#1088;&#1074;&#1072;&#1103; &#1076;&#1072;&#1077;&#1090; &#1073;&#1086;&#1083;&#1100;&#1096;&#1091;&#1102; &#1075;&#1080;&#1073;&#1082;&#1086;&#1089;&#1090;&#1100; &#1080; &#1076;&#1080;&#1085;&#1072;&#1084;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103;.</span></p><p class="c6"><span class="c0">&#1054;&#1073;&#1080;&#1083;&#1080;&#1077; &#1078;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090; &#1086; &#1085;&#1072;&#1088;&#1091;&#1096;&#1077;&#1085;&#1080;&#1080; </span><span class="c1"><a class="c17" href="http://www.google.com/url?q=http%3A%2F%2Fen.wikipedia.org%2Fwiki%2FDependency_inversion_principle&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNFvV2u56dGu0D6UNnQy8YhjJmGuaA">&#1055;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1072; &#1048;&#1085;&#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1047;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081;</a></span><span class="c0">, &#1089;&#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084; &#1041;&#1086;&#1073;&#1086;&#1084; &#1052;&#1072;&#1088;&#1090;&#1080;&#1085;&#1086;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1074; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1093; &#1072;&#1075;&#1088;&#1077;&#1075;&#1072;&#1094;&#1080;&#1080; &#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080;: </span><span class="c0 c11">&#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1080;&#1090;&#1072;&#1081;&#1090;&#1077; &#1072;&#1075;&#1088;&#1077;&#1075;&#1072;&#1094;&#1080;&#1102; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080;</span><span class="c0">, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1087;&#1077;&#1088;&#1074;&#1072;&#1103; &#1089;&#1090;&#1080;&#1084;&#1091;&#1083;&#1080;&#1088;&#1091;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1094;&#1080;&#1081;, &#1072; &#1085;&#1077; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;.</span></p><p class="c6"><span class="c0 c11">&#1042; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1088;&#1072;&#1079;:</span><span class="c0">&nbsp;&#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1077;&#1084; &#1082; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1080;&#1102; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1093; DI &#1087;&#1072;&#1090;&#1090;&#1077;&#1088;&#1085;&#1086;&#1074; &#1080; &#1085;&#1072;&#1095;&#1085;&#1077;&#1084; &#1089; &#1089;&#1072;&#1084;&#1086;&#1075;&#1086; &#1087;&#1086;&#1087;&#1091;&#1083;&#1103;&#1088;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1085;&#1080;&#1093; &ndash; &#1089; Constructor Injection.</span></p><p class="c9 c13"><span></span></p></body></html>