<html><head><title>&#1053;&#1086;&#1074;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;</title><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">ol{margin:0;padding:0}.c0{widows:2;orphans:2;height:11pt;direction:ltr}.c1{widows:2;orphans:2;direction:ltr}.c2{max-width:468pt;background-color:#ffffff;padding:72pt 72pt 72pt 72pt}.title{widows:2;padding-top:0pt;line-height:1.15;orphans:2;text-align:left;color:#000000;font-size:21pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}.subtitle{widows:2;padding-top:0pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-style:italic;font-size:13pt;font-family:"Trebuchet MS";padding-bottom:10pt;page-break-after:avoid}li{color:#000000;font-size:11pt;font-family:"Arial"}p{color:#000000;font-size:11pt;margin:0;font-family:"Arial"}h1{widows:2;padding-top:10pt;line-height:1.15;orphans:2;text-align:left;color:#000000;font-size:16pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}h2{widows:2;padding-top:10pt;line-height:1.15;orphans:2;text-align:left;color:#000000;font-size:13pt;font-family:"Trebuchet MS";font-weight:bold;padding-bottom:0pt;page-break-after:avoid}h3{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-size:12pt;font-family:"Trebuchet MS";font-weight:bold;padding-bottom:0pt;page-break-after:avoid}h4{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-size:11pt;text-decoration:underline;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}h5{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-size:11pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}h6{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-style:italic;font-size:11pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}</style></head><body class="c2"><p class="c1"><span>&#1040;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1094;&#1080;&#1103;</span></p><p class="c1"><span>&#1057;&#1087;&#1086;&#1089;&#1086;&#1073; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1072;&#1073;&#1086;&#1088; &#1079;&#1085;&#1072;&#1095;&#1080;&#1084;&#1099;&#1093; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1080;&#1079; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1079;&#1085;&#1072;&#1095;&#1080;&#1084;&#1099;&#1077;. &#1053;&#1072;&#1073;&#1086;&#1088; &#1079;&#1085;&#1072;&#1095;&#1080;&#1084;&#1099;&#1093; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1094;&#1080;&#1077;&#1081;.</span></p><p class="c0"><span></span></p><p class="c1"><span>&#1048;&#1085;&#1082;&#1072;&#1087;&#1089;&#1091;&#1083;&#1103;&#1094;&#1080;&#1103;</span></p><p class="c1"><span>&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1077;&#1077; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1097;&#1080;&#1077; &#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1077; &#1080; &#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1080;&#1093; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1102;.</span></p><p class="c0"><span></span></p><p class="c1"><span>&#1053;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</span></p><p class="c1"><span>&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1074;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1077;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1082;&#1083;&#1072;&#1089;&#1089; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1091;&#1078;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1089; &#1095;&#1072;&#1089;&#1090;&#1080;&#1095;&#1085;&#1086; &#1080;&#1083;&#1080; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1079;&#1072;&#1080;&#1084;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;.</span></p><p class="c0"><span></span></p><p class="c1"><span>&#1055;&#1086;&#1083;&#1080;&#1084;&#1086;&#1088;&#1092;&#1080;&#1079;&#1084;</span></p><p class="c1"><span>&#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1089; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1084; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1084; &#1073;&#1077;&#1079; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1086; &#1090;&#1080;&#1087;&#1077; &#1080; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1077;&#1081; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;</span></p><p class="c0"><span></span></p><p class="c1"><span>&#1050;&#1083;&#1072;&#1089;&#1089;</span></p><p class="c1"><span>&#1047;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1072;&#1103; &#1074; &#1082;&#1086;&#1076;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1097;&#1072;&#1103;&#1103; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;.</span></p><p class="c0"><span></span></p><p class="c1"><span>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</span></p><p class="c1"><span>&#1056;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1080;&#1084;&#1077;&#1102;&#1097;&#1072;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;.</span></p><p class="c0"><span></span></p><p class="c1"><span>&#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;</span></p><p class="c1"><span>&#1057;&#1077;&#1084;&#1072;&#1085;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1080; &#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103; &#1074; &#1082;&#1086;&#1076;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1072;&#1103; &#1076;&#1083;&#1103; &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1091;&#1089;&#1083;&#1091;&#1075;, &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1084; &#1080;&#1083;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1084;.</span></p><p class="c1"><span>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084;&#1080; &#1080;&#1083;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080;, &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1091;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1091;&#1102; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1094;&#1080;&#1102;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1102;&#1097;&#1072;&#1103; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1072;. </span></p><p class="c1"><span>&#1048;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1099; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1085;&#1072;&#1083;&#1072;&#1076;&#1080;&#1090;&#1100; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1080; &#1074; &#1090;&#1086; &#1078;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1080;&#1079;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100;&#1089;&#1103; &#1086;&#1090; &#1088;&#1086;&#1084;&#1073;&#1086;&#1074;&#1080;&#1076;&#1085;&#1086;&#1075;&#1086; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</span></p><p class="c0"><span></span></p></body></html>