<html><head><title>&#1053;&#1086;&#1074;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;</title><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">.lst-kix_kgknghnj7ic4-8>li:before{content:"\0025a0  "}.lst-kix_r6w3nujvd6ud-5>li:before{content:"\0025a0  "}.lst-kix_5qt7ws2j3a46-5>li:before{content:"\0025a0  "}.lst-kix_5qt7ws2j3a46-2>li:before{content:"\0025a0  "}.lst-kix_r6w3nujvd6ud-7>li:before{content:"\0025cb  "}.lst-kix_kgknghnj7ic4-2>li:before{content:"\0025a0  "}ul.lst-kix_5qt7ws2j3a46-5{list-style-type:none}ul.lst-kix_5qt7ws2j3a46-4{list-style-type:none}ul.lst-kix_5qt7ws2j3a46-3{list-style-type:none}ul.lst-kix_5qt7ws2j3a46-2{list-style-type:none}ul.lst-kix_5qt7ws2j3a46-1{list-style-type:none}ul.lst-kix_5qt7ws2j3a46-0{list-style-type:none}.lst-kix_r6w3nujvd6ud-4>li:before{content:"\0025cb  "}ul.lst-kix_5qt7ws2j3a46-8{list-style-type:none}ul.lst-kix_5qt7ws2j3a46-7{list-style-type:none}.lst-kix_kgknghnj7ic4-0>li:before{content:"\0025cf  "}ul.lst-kix_5qt7ws2j3a46-6{list-style-type:none}.lst-kix_kgknghnj7ic4-5>li:before{content:"\0025a0  "}.lst-kix_kgknghnj7ic4-7>li:before{content:"\0025cb  "}.lst-kix_kgknghnj7ic4-6>li:before{content:"\0025cf  "}.lst-kix_r6w3nujvd6ud-3>li:before{content:"\0025cf  "}.lst-kix_5qt7ws2j3a46-1>li:before{content:"\0025cb  "}ul.lst-kix_kgknghnj7ic4-8{list-style-type:none}ul.lst-kix_kgknghnj7ic4-7{list-style-type:none}ul.lst-kix_kgknghnj7ic4-6{list-style-type:none}ul.lst-kix_kgknghnj7ic4-5{list-style-type:none}ul.lst-kix_kgknghnj7ic4-4{list-style-type:none}ul.lst-kix_kgknghnj7ic4-3{list-style-type:none}ul.lst-kix_kgknghnj7ic4-2{list-style-type:none}.lst-kix_r6w3nujvd6ud-2>li:before{content:"\0025a0  "}.lst-kix_kgknghnj7ic4-4>li:before{content:"\0025cb  "}.lst-kix_5qt7ws2j3a46-6>li:before{content:"\0025cf  "}ul.lst-kix_kgknghnj7ic4-1{list-style-type:none}ul.lst-kix_kgknghnj7ic4-0{list-style-type:none}ul.lst-kix_r6w3nujvd6ud-4{list-style-type:none}ul.lst-kix_r6w3nujvd6ud-3{list-style-type:none}.lst-kix_r6w3nujvd6ud-6>li:before{content:"\0025cf  "}ul.lst-kix_r6w3nujvd6ud-2{list-style-type:none}.lst-kix_r6w3nujvd6ud-0>li:before{content:"\0025cf  "}ul.lst-kix_r6w3nujvd6ud-1{list-style-type:none}.lst-kix_kgknghnj7ic4-3>li:before{content:"\0025cf  "}ul.lst-kix_r6w3nujvd6ud-0{list-style-type:none}.lst-kix_r6w3nujvd6ud-1>li:before{content:"\0025cb  "}ul.lst-kix_r6w3nujvd6ud-8{list-style-type:none}ul.lst-kix_r6w3nujvd6ud-7{list-style-type:none}ul.lst-kix_r6w3nujvd6ud-6{list-style-type:none}ul.lst-kix_r6w3nujvd6ud-5{list-style-type:none}.lst-kix_r6w3nujvd6ud-8>li:before{content:"\0025a0  "}.lst-kix_kgknghnj7ic4-1>li:before{content:"\0025cb  "}.lst-kix_5qt7ws2j3a46-7>li:before{content:"\0025cb  "}.lst-kix_5qt7ws2j3a46-8>li:before{content:"\0025a0  "}.lst-kix_5qt7ws2j3a46-0>li:before{content:"\0025cf  "}.lst-kix_5qt7ws2j3a46-3>li:before{content:"\0025cf  "}.lst-kix_5qt7ws2j3a46-4>li:before{content:"\0025cb  "}ol{margin:0;padding:0}.c3{padding-left:0pt;line-height:1.0;padding-top:1pt;widows:2;margin-right:17pt;orphans:2;direction:ltr;margin-left:53pt;padding-bottom:1pt}.c0{line-height:1.0;padding-top:1pt;widows:2;orphans:2;height:11pt;direction:ltr;padding-bottom:1pt}.c4{line-height:1.0;padding-top:1pt;widows:2;orphans:2;direction:ltr;padding-bottom:1pt}.c10{color:#0f8dd9;font-size:10pt;font-family:"Arial";font-weight:normal}.c9{color:#000080;font-size:10pt;font-weight:bold}.c7{max-width:595.6pt;background-color:#ffffff;padding:28.3pt 9.6pt 28.3pt 6.8pt}.c5{margin:0;padding:0}.c1{color:#333333;font-size:10pt}.c11{color:#333333}.c2{font-size:8pt}.c12{page-break-after:avoid}.c6{background-color:#f6f6f6}.c8{margin-right:17pt}.title{widows:2;padding-top:0pt;line-height:1.15;orphans:2;text-align:left;color:#000000;font-size:21pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}.subtitle{widows:2;padding-top:0pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-style:italic;font-size:13pt;font-family:"Trebuchet MS";padding-bottom:10pt;page-break-after:avoid}li{color:#000000;font-size:11pt;font-family:"Arial"}p{color:#000000;font-size:11pt;margin:0;font-family:"Arial"}h1{widows:2;padding-top:10pt;line-height:1.15;orphans:2;text-align:left;color:#000000;font-size:16pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}h2{widows:2;padding-top:10pt;line-height:1.15;orphans:2;text-align:left;color:#000000;font-size:13pt;font-family:"Trebuchet MS";font-weight:bold;padding-bottom:0pt;page-break-after:avoid}h3{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-size:12pt;font-family:"Trebuchet MS";font-weight:bold;padding-bottom:0pt;page-break-after:avoid}h4{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-size:11pt;text-decoration:underline;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}h5{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-size:11pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}h6{widows:2;padding-top:8pt;line-height:1.15;orphans:2;text-align:left;color:#666666;font-style:italic;font-size:11pt;font-family:"Trebuchet MS";padding-bottom:0pt;page-break-after:avoid}</style></head><body class="c7"><p class="c4"><span class="c1">&nbsp;&#1042; &#1083;&#1080;&#1090;&#1077;&#1088;&#1072;&#1090;&#1091;&#1088;&#1077; &#1087;&#1086; Java &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082;&#1080;&#1077; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1099;, &#1082;&#1072;&#1082; &quot;&#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;&quot; (inner classes) &#1080; &quot;&#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;&quot; (nested classes). &#1043;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1100; &#1084;&#1099; &#1073;&#1091;&#1076;&#1077;&#1084; &#1086; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1093;, &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; inner &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076;&#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084;. &#1058;&#1077;&#1084; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077; &#1095;&#1072;&#1089;&#1090;&#1086; &#1087;&#1086;&#1076; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1084;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084;&#1080; &#1087;&#1086;&#1076;&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;&#1089;&#1077; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; - &#1074;&#1086;&#1090; &#1090;&#1072;&#1082;&#1086;&#1081; &#1074;&#1086;&#1090; &#1087;&#1072;&#1088;&#1072;&#1076;&#1086;&#1082;&#1089;.</span></p><p class="c4"><span class="c1">&#1048;&#1090;&#1072;&#1082;, &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; - &#1101;&#1090;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:</span></p><p class="c4"><span class="c9 c6">class</span><span class="c1 c6">&nbsp;OuterClass { </span></p><p class="c4"><span class="c1 c6">&nbsp; &nbsp; ... </span></p><p class="c4"><span class="c1 c6">&nbsp; &nbsp; </span><span class="c9 c6">static</span><span class="c1 c6">&nbsp;</span><span class="c6 c9">class</span><span class="c1 c6">&nbsp;StaticNestedClass { </span></p><p class="c4"><span class="c1 c6">&nbsp; &nbsp; &nbsp; &nbsp; ... </span></p><p class="c4"><span class="c1 c6">&nbsp; &nbsp; } </span></p><p class="c4"><span class="c1 c6">&nbsp; &nbsp; ... </span></p><p class="c4"><span class="c1 c6">} </span></p><p class="c4"><span class="c1 c6">&nbsp;</span></p><p class="c4"><span class="c1">&#1042;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1076;&#1077;&#1083;&#1103;&#1090;&#1089;&#1103; &#1085;&#1072; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; (&#1074; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1074;&#1099;&#1096;&#1077; StaticNestedClass - &#1101;&#1090;&#1086; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1086;&#1085;) &#1080; &#1085;&#1077;&#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; (non-static). &#1057;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1085;&#1077;&#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1080;&#1084;&#1077;&#1102;&#1090; &#1080; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; - &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; (inner classes). &#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; (outer class) &#1084;&#1099; &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1073;&#1091;&#1076;&#1077;&#1084; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1077;&#1097;&#1077; &#1086;&#1073;&#1088;&#1072;&#1084;&#1083;&#1103;&#1102;&#1097;&#1080;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1084;.</span></p><p class="c0"><span class="c1"></span></p><h2 class="c4 c12"><a name="h.80hgvmq4h9v5"></a><span class="c10">&#1057;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; (static nested classes)</span></h2><p class="c4"><span class="c1">&#1057;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;, &#1085;&#1077; &#1080;&#1084;&#1077;&#1102;&#1090; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1085;&#1077;&#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1087;&#1086;&#1083;&#1103;&#1084; &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&#1084; &#1086;&#1073;&#1088;&#1072;&#1084;&#1083;&#1103;&#1102;&#1097;&#1077;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1095;&#1090;&#1086; &#1074; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1088;&#1086;&#1076;&#1077; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1086; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&#1084;, &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. &#1044;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1085;&#1077;&#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1087;&#1086;&#1083;&#1103;&#1084; &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&#1084; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1077;&#1088;&#1077;&#1079; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1086;&#1073;&#1088;&#1072;&#1084;&#1083;&#1103;&#1102;&#1097;&#1077;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1087;&#1083;&#1072;&#1085;&#1077; static nested &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1086;&#1093;&#1086;&#1078;&#1080; &#1085;&#1072; &#1083;&#1102;&#1073;&#1099;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103;.</span></p><p class="c4"><span class="c1">&#1050;&#1088;&#1086;&#1084;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086;, static nested &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1080;&#1084;&#1077;&#1102;&#1090; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1083;&#1102;&#1073;&#1099;&#1084; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&#1084; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1074; &#1090;&#1086;&#1084; &#1095;&#1080;&#1089;&#1083;&#1077; &#1080; &#1082; &#1087;&#1088;&#1080;&#1074;&#1072;&#1090;&#1085;&#1099;&#1084;.</span></p><p class="c4"><span class="c1">&#1055;&#1086;&#1083;&#1100;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1084; &#1074; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1082;&#1077; &#1089;&#1091;&#1097;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;, &#1074; &#1091;&#1083;&#1091;&#1095;&#1096;&#1077;&#1085;&#1080;&#1080; &#1080;&#1085;&#1082;&#1072;&#1087;&#1089;&#1091;&#1083;&#1103;&#1094;&#1080;&#1080;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1074; &#1101;&#1082;&#1086;&#1085;&#1086;&#1084;&#1080;&#1080; class-space.</span></p><p class="c0"><span class="c1"></span></p><h2 class="c4 c12"><a name="h.2j6sr6vj7y59"></a><span class="c10">&#1042;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;-&#1095;&#1083;&#1077;&#1085;&#1099; (member inner classes)</span></h2><p class="c4"><span class="c1">&#1042;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1074; Java &#1076;&#1077;&#1083;&#1103;&#1090;&#1089;&#1103; &#1085;&#1072; &#1090;&#1072;&#1082;&#1080;&#1077; &#1090;&#1088;&#1080; &#1074;&#1080;&#1076;&#1072;:</span></p><ul class="c5 lst-kix_5qt7ws2j3a46-0 start"><li class="c3"><span class="c1">&#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;-&#1095;&#1083;&#1077;&#1085;&#1099; (member inner classes);</span></li><li class="c3"><span class="c1">&#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; (local classes);</span></li><li class="c3"><span class="c1">&#1072;&#1085;&#1086;&#1085;&#1080;&#1084;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; (anonymous classes).</span></li></ul><p class="c4"><span class="c1">&#1042;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;-&#1095;&#1083;&#1077;&#1085;&#1099; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1085;&#1077; &#1089; &#1089;&#1072;&#1084;&#1080;&#1084; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1084;, &#1072; &#1089; &#1077;&#1075;&#1086; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1084;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1086;&#1085;&#1080; &#1080;&#1084;&#1077;&#1102;&#1090; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082;&#1086; &#1074;&#1089;&#1077;&#1084; &#1077;&#1075;&#1086; &#1087;&#1086;&#1083;&#1103;&#1084; &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&#1084;. </span><span class="c1 c6">&nbsp;</span><span class="c1">inner class &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1081;. &#1042;&#1084;&#1077;&#1089;&#1090;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1073;&#1098;&#1103;&#1074;&#1080;&#1090;&#1100; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1091; &#1086;&#1073;&#1088;&#1072;&#1084;&#1083;&#1103;&#1102;&#1097;&#1077;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086;, &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1103;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103;.</span></p><p class="c4"><span class="c1">&#1045;&#1097;&#1077; &#1086;&#1076;&#1085;&#1072; &#1074;&#1072;&#1078;&#1085;&#1072;&#1103; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; - &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1099; &#1074; Java &#1085;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1085;&#1089;&#1090;&#1072;&#1085;&#1094;&#1080;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1086;&#1073;&#1098;&#1103;&#1074;&#1080;&#1090;&#1100; &#1085;&#1077;&#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1085;&#1086; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1076;&#1083;&#1103; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1080; &#1089; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1084; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. </span></p><p class="c0"><span class="c1"></span></p><p class="c4"><span class="c1 c6">&nbsp;</span><span class="c10">&#1051;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; (local inner classes)</span></p><p class="c4"><span class="c1">&#1051;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; (local classes) &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074; &#1073;&#1083;&#1086;&#1082;&#1077; Java &#1082;&#1086;&#1076;&#1072;. &#1053;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077; &#1095;&#1072;&#1097;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1084;&#1077;&#1090;&#1086;&#1076;&#1077; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. &#1061;&#1086;&#1090;&#1103; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1103;&#1090;&#1100; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1080; &#1085;&#1077;&#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074; &#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;.</span></p><p class="c4"><span class="c1">&#1050;&#1072;&#1082; &#1080; member &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;, &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1089; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1084; &#1086;&#1073;&#1088;&#1072;&#1084;&#1083;&#1103;&#1102;&#1097;&#1077;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1080; &#1080;&#1084;&#1077;&#1102;&#1090; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1077;&#1075;&#1086; &#1087;&#1086;&#1083;&#1103;&#1084; &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&#1084;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086;, &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1084; &#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1099; &#1089; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084; final.</span></p><p class="c4"><span class="c1">&#1059; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1077;&#1089;&#1090;&#1100; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081;:</span></p><ul class="c5 lst-kix_r6w3nujvd6ud-0 start"><li class="c3"><span class="c1">&#1086;&#1085;&#1080; &#1074;&#1080;&#1076;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1093; &#1073;&#1083;&#1086;&#1082;&#1072;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1099;;</span></li><li class="c3"><span class="c1">&#1086;&#1085;&#1080; &#1085;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1099; &#1082;&#1072;&#1082; private, public, protected &#1080;&#1083;&#1080; static;</span></li><li class="c3"><span class="c1">&#1086;&#1085;&#1080; &#1085;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1089;&#1077;&#1073;&#1103; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1081; (&#1087;&#1086;&#1083;&#1077;&#1081;, &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074;, &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;); &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1099; (static final);</span></li></ul><p class="c4"><span class="c1">&#1050;&#1089;&#1090;&#1072;&#1090;&#1080;, &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1099; &#1090;&#1086;&#1078;&#1077; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1103;&#1090;&#1100; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086; &#1087;&#1086; &#1090;&#1077;&#1084; &#1078;&#1077; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072;&#1084;, &#1087;&#1086; &#1082;&#1072;&#1082;&#1080;&#1084; &#1080;&#1093; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1103;&#1090;&#1100; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1084;&#1080;.</span></p><p class="c0"><span class="c1"></span></p><h2 class="c4 c12"><a name="h.43qtut80d3di"></a><span class="c10">&#1040;&#1085;&#1086;&#1085;&#1080;&#1084;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; (anonymous inner classes)</span></h2><p class="c4"><span class="c1">&#1040;&#1085;&#1086;&#1085;&#1080;&#1084;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074;&#1072;&#1078;&#1085;&#1099;&#1084; &#1087;&#1086;&#1076;&#1089;&#1087;&#1086;&#1088;&#1100;&#1077;&#1084; &#1074; &#1087;&#1086;&#1074;&#1089;&#1077;&#1076;&#1085;&#1077;&#1074;&#1085;&#1086;&#1081; &#1078;&#1080;&#1079;&#1085;&#1080; Java-&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1086;&#1074;. &#1040;&#1085;&#1086;&#1085;&#1080;&#1084;&#1085;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; (anonymous class) - &#1101;&#1090;&#1086; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; &#1073;&#1077;&#1079; &#1080;&#1084;&#1077;&#1085;&#1080;.</span></p><p class="c4"><span class="c1">&#1050;&#1083;&#1072;&#1089;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1072;&#1085;&#1086;&#1085;&#1080;&#1084;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;:</span></p><p class="c4"><span class="c1 c6"><br> &nbsp; &nbsp;new Thread(new Runnable() {<br> &nbsp; &nbsp; &nbsp; &nbsp;public void run() {<br> &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;...<br> &nbsp; &nbsp; &nbsp; &nbsp;}<br> &nbsp; &nbsp;}).start();<br><br></span><span class="c1">&#1053;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1072;&#1085;&#1086;&#1085;&#1080;&#1084;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1090;&#1086;&#1082; &#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; start &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; Thread. &#1057;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1072;&#1085;&#1086;&#1085;&#1080;&#1084;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1073;&#1072;&#1079;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072; new &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; (&#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;) &#1080; &#1090;&#1077;&#1083;&#1086;&#1084; &#1085;&#1086;&#1074;&#1086;&#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1072;&#1085;&#1086;&#1085;&#1080;&#1084;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;.</span></p><p class="c4"><span class="c1">&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1072;&#1085;&#1086;&#1085;&#1080;&#1084;&#1085;&#1099;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; - &#1101;&#1090;&#1086; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1082;&#1083;&#1072;&#1089;&#1089; &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1080;&#1084;&#1077;&#1085;&#1080;. &#1040;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; &#1089;&#1082;&#1086;&#1073;&#1082;&#1072;&#1093;, &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1089; &#1090;&#1077;&#1084;&#1080; &#1078;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1084;&#1080;.</span></p><p class="c4"><span class="c1">&#1058;&#1072;&#1082; &#1082;&#1072;&#1082; &#1072;&#1085;&#1086;&#1085;&#1080;&#1084;&#1085;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1084;, &#1086;&#1085; &#1080;&#1084;&#1077;&#1077;&#1090; &#1074;&#1089;&#1077; &#1090;&#1077; &#1078;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1095;&#1090;&#1086; &#1080; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089;.</span></p><p class="c4"><span class="c1">&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1072;&#1085;&#1086;&#1085;&#1080;&#1084;&#1085;&#1099;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1086;&#1087;&#1088;&#1072;&#1074;&#1076;&#1072;&#1085;&#1086; &#1074;&#1086; &#1084;&#1085;&#1086;&#1075;&#1080;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093;, &#1074; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080; &#1082;&#1086;&#1075;&#1076;&#1072;:</span></p><ul class="c5 lst-kix_kgknghnj7ic4-0 start"><li class="c3"><span class="c1">&#1090;&#1077;&#1083;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1095;&#1077;&#1085;&#1100; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1080;&#1084;;</span></li><li class="c3"><span class="c1">&#1085;&#1091;&#1078;&#1077;&#1085; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;;</span></li><li class="c3"><span class="c1">&#1082;&#1083;&#1072;&#1089;&#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1084;&#1077;&#1089;&#1090;&#1077; &#1077;&#1075;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1089;&#1088;&#1072;&#1079;&#1091; &#1087;&#1086;&#1089;&#1083;&#1077; &#1085;&#1077;&#1075;&#1086;;</span></li><li class="c3"><span class="c1">&#1080;&#1084;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1085;&#1077; &#1074;&#1072;&#1078;&#1085;&#1086; &#1080; &#1085;&#1077; &#1086;&#1073;&#1083;&#1077;&#1075;&#1095;&#1072;&#1077;&#1090; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1076;&#1072;.</span></li></ul><p class="c0 c8"><span class="c2 c11"></span></p><p class="c0"><span class="c2"></span></p></body></html>